hwchaos/BETTA-HA-PANEL-ESP32-P4-WIFI6-Touch-LCD-4.3/sdkconfig.defaults.panel43
# SPDX-License-Identifier: LicenseRef-FNCL-1.1
# Waveshare ESP32-P4-WIFI6-Touch-LCD-4.3 (480x800 MIPI-DSI ST7701, GT911)
# Sub-variant of the 7B build.
CONFIG_IDF_TARGET="esp32p4"
CONFIG_APP_PANEL_VARIANT_7INCH_1024=y
# CONFIG_APP_PANEL_VARIANT_4INCH_720 is not set
CONFIG_APP_PANEL_BOARD_WAVESHARE_43=y
# CONFIG_APP_FEATURE_LOCAL_CAMERA is not set

CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_FREERTOS_ISR_STACKSIZE=6144
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
# CONFIG_COMPILER_OPTIMIZATION_SIZE is not set

CONFIG_ESP_LCD_TOUCH_MAX_POINTS=5
CONFIG_LV_USE_LODEPNG=y

# P4 silicon revision 1.x (< 3.0)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# LVGL memory (must match ui/lv_psram_mem.c)
# CONFIG_LV_USE_CLIB_MALLOC is not set
CONFIG_LV_USE_CUSTOM_MALLOC=y
CONFIG_LV_USE_FONT_COMPRESSED=y

CONFIG_ESP_HTTP_CLIENT_ENABLE_DIGEST_AUTH=y
CONFIG_VFS_MAX_COUNT=16

# 32 MB flash: 4-byte addressing
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_BOOTLOADER_CACHE_32BIT_ADDR_QUAD_FLASH=y

CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# Logging (same as 7B)
# CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT is not set
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL=3
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_LOG_LEVEL=2
CONFIG_LV_LOG_USE_TIMESTAMP=y
CONFIG_LV_LOG_USE_FILE_LINE=y

# Crash core dump to flash (same as 7B)
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
# CONFIG_ESP_COREDUMP_ENABLE_TO_UART is not set
# CONFIG_ESP_COREDUMP_ENABLE_TO_NONE is not set
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
# CONFIG_ESP_COREDUMP_CAPTURE_DRAM is not set
CONFIG_ESP_COREDUMP_CHECK_BOOT=y
CONFIG_ESP_COREDUMP_LOGS=y
CONFIG_ESP_COREDUMP_MAX_TASKS_NUM=24
